class-1/hello-world/artillery-config.yml
config:
  target: "http://144.126.252.10" #// load balancer
  # target: "http://159.89.166.34" #// bigger machine
  # target: "http://144.126.252.5" #// smaller machine

  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 20
      name: Warm up
    - duration: 200
      arrivalRate: 50
      # rampTo: 100
      name: Ramp up load
    - duration: 100
      arrivalRate: 500
      name: Crash!
  # payload:
  #   # Load search keywords from an external CSV file and make them available
  #   # to virtual user scenarios as variable "keywords":
  #   path: "keywords.csv"
  #   fields:
  #     - "keywords"
scenarios:
  # We define one scenario:
  - name: "Home page"
    flow:
      # - post:
      #     url: "/"
      #     # body: "kw={{ keywords }}"
      #     # The endpoint responds with JSON, which we parse and extract a field from
      #     # to use in the next request:
      #     # capture:
      #     # json: "$.results[0].id"
      #     # as: "id"
      # # Get the details of the product:
      # - get:
      #     url: "/product/{{ id }}/details"
      # Pause for 3 seconds:
      # - think: 3
      # Add product to cart:
      # - post:
      #     url: "/cart"
      #     json:
      #       productId: "{{ id }}"
      - get:
          url: "/"